/*Задача №2
Результатом должна быть консольная программа с текстовым меню. Программа должна содержать шаблонный класс для управления данными согласно заданию.
Для хранения данных необходимо выбрать оптимальный с точки зрения задания контейнер.
1. Предусмотреть операции добавления, изменения и удаления элемента контейнера.
2. Реализовать ввод и вывод элементов контейнера с использованием потоковых итераторов на экран и в файл.
3. Реализовать операции поиска по заданным критериям и выборки подмножества элементов по заданным критериям.
Реализовать поиск в двух вариантах: линейный поиск и двоичный поиск на отсортированном контейнере.
4. Предусмотреть вывод подмножества выборки на экран и в файл.

Задание 14. Оплата счета представлена структурой с полями:
название фирмы, вид работ, единица измерения, стоимость единицы выполненной работы, дата исполнения, объем работ.
Поиск по названию фирмы, виду работ, дате исполнения.*/

#include "MainMenu.h"

int main()
{
    main_menu();
    return 0;
}

